[{"Party":"Labour","Name":"Kiritapu Allan","Headshot":"allan.jpeg","Description":"Kiri Allan is a staunch advocate for the East Coast region and is committed to shaping New Zealand as a place where everyone can live and thrive."},{"Party":"Labour","Name":"Ginny Andersen","Headshot":"andersen.jpg","Description":"Ginny is a longstanding member of the Labour Party, joining in 2004, and serving as the Party Vice President from 2015-2017."},{"Party":"ACT","Name":"Chris Ballie","Headshot":"baillie.jpg","Description":"Before entering Parliament, Chris worked for 22-years as a teacher with students who have special learning needs, he trained as an English and Music teacher."},{"Party":"National","Name":"Andew Bayly","Headshot":"bayly.jpeg","Description":"National is focused on supporting Port Waikato and your livelihood, from backing Kiwis who have lost their jobs and are looking to start their own business, to backing existing businesses to take on another employee."},{"Party":"Labour","Name":"Camilla Belich","Headshot":"belich.jpg","Description":"I stood for Parliament because we have more work to do to build a fairer, kinder, more equal New Zealand for our children and grandchildren."},{"Party":"National","Name":"David Bennett","Headshot":"bennett.jpg","Description":"National is focused on supporting Hamilton and your livelihood, from backing Kiwis who have lost their jobs and are looking to start their own business, to backing existing businesses to take on another employee."},{"Party":"Labour","Name":"Glen Bennett","Headshot":"bennett2.jpg","Description":"I'm committed to a nation that cares deeply for our people, as well as our planet, and Labour has strongly demonstrated its focus on both."},{"Party":"National","Name":"Chris Bishop","Headshot":"bishop.jpg","Description":"Getting things done for the Hutt is my top priority."},{"Party":"Labour","Name":"Rachel Boyack","Headshot":"boyack.jpg","Description":"I want Nelson to be a place of opportunity so that our young people can see a future in the region for them and their families."},{"Party":"Labour","Name":"Rachel Brooking","Headshot":"brooking.jpg","Description":"I’m proud of the Labour-led Government’s strong, responsive, open, and iterative approach to COVID-19. My focus is on positive action on climate change that is adaptive, evidence based, and community focussed"},{"Party":"Labour","Name":"Chris Hipkins","Headshot":"hipkins.jpg","Description":"No matter who you are or where you come from, everyone deserves the opportunity to fulfil their potential and live life to the fullest. We all have a responsibility to ensure nobody gets held back because of circumstances beyond their control."},{"Party":"National","Name":"Simeon Brown","Headshot":"brown.jpg","Description":"I recently launched a petition calling on Auckland Transport to restore the speed limits on our local roads to their previous limits and stop trying to slow Auckland down"},{"Party":"National","Name":"Gerry Brownly","Headshot":"brownlee.jpg","Description":"National is focused on supporting Ilam and your livelihood, from backing Kiwis who have lost their jobs and are looking to start their own business, to backing existing businesses to take on another employee."},{"Party":"ACT","Name":"Mark Cameron","Headshot":"cameron.jpg","Description":"Mark is the authentic voice of rural New Zealand. Mark is a dairy farmer from Ruawai, Northland. He's lived and farmed around the Northland region for 30-years. He has a partner, and three children."},{"Party":"Labour","Name":"Naisi Chen","Headshot":"chen.jpg","Description":"I believe New Zealand’s diverse community is critical in shaping our future. I’m proud of the work our Government is doing to support all Kiwis, so Aotearoa can enjoy economic and social growth."},{"Party":"ACT","Name":"Karen Chhour","Headshot":"chhour.jpg","Description":"Nearly every MP says they want to reform CYFPs\/CYFs\/Oranga Tamariki. Karen lived it and came to Parliament to make a better world for children. Her own story of overcoming adversity to have a loved family of her own and a successful business is the embodiment of ACT values. She changed her future."},{"Party":"Labour","Name":"David Clark","Headshot":"clark.jpg","Description":"Hon Dr David Clark is the Labour Member of Parliament for Dunedin. He came to Parliament in 2011 via a circuitous route – having run a University of Otago residential college, worked as a Presbyterian Minister, and worked as a Treasury analyst. David has held a number of ministerial portfolios, including Commerce & Consumer Affairs, the Digital Economy & Communications, and State Owned Enterprises. "},{"Party":"Labour","Name":"Tamati Coffey","Headshot":"coffey.jpg","Description":"We must constantly be asking ourselves; what more can we do, to allow Māori to realise their rangatiratanga?"},{"Party":"National","Name":"Judith Collins","Headshot":"collins.jpg","Description":"We should all be proud of our collective response to COVID-19 and my absolute focus as MP for Papakura will be our economic recovery.We will save jobs, we will get the economy growing again and we will do so by leveraging our country’s great strengths: our people, our communities, our great natural resources and our values of hard work, tenacity, innovation and aspiration.I'm about ideas that get results."},{"Party":"ACT","Name":"Simon Court","Headshot":"court.jpg","Description":"Simon is a Civil and Environmental Engineer with 23-years’ experience in roles for the private sector and local government. This includes 10-years leading engineering, planning, tendering, and construction teams primarily in Auckland, Wellington, and Fiji."},{"Party":"Labour","Name":"Liz Craig","Headshot":"craig.jpg","Description":"I believe every child should have the best possible start in life and that the Government has an active role to play in protecting the environment and ensuring everyone can access the services they need."},{"Party":"Green","Name":"Marama Davidson","Headshot":"davidson.jpg","Description":"I am enthusiastic and excited about making change that honours our connection to each other, and our planet."},{"Party":"Labour","Name":"Kelvin Davis","Headshot":"davis.jpg","Description":"The future prosperity of our country requires us to make brave and bold decisions today."},{"Party":"National","Name":"Jacqui Dean","Headshot":"dean.jpg","Description":"National is focused on supporting Waitaki and your livelihood, from backing Kiwis who have lost their jobs and are looking to start their own business, to backing existing businesses to take on another employee."},{"Party":"National","Name":"Matt Doocey","Headshot":"doocey.jpg","Description":"As MP for Waimakariri, I’m always looking at ways to support residents, have their voices heard and help facilitate positive outcomes. It’s important that I am across the views of Waimakariri constituents so I can accurately represent them in Parliament."},{"Party":"Labour","Name":"Paul Eagle","Headshot":"eagle.jpg","Description":"I want every child in Aotearoa New Zealand to grow up in a safe, healthy, caring country. I’m committed to reforming adoption legislation to ensure it connects children to their past while helping support their future wellbeing."},{"Party":"Labour","Name":"Barbara Edmonds","Headshot":"edmonds.jpg","Description":"Fa'afetai tele lava to the people of Mana for entrusting me with your voice. I will work hard to make Mana the best place to live, work, go to school, and raise a family."},{"Party":"Green","Name":"Julie Anne Genter","Headshot":"genter.jpg","Description":"Julie Anne is working for more sustainable and just communities, and advocates for infrastructure that delivers for our people and protects the climate."},{"Party":"Green","Name":"Golriz Ghahraman","Headshot":"ghahraman.jpg","Description":"Golriz is an Iranian-Kiwi refugee and made history as the first ever refugee to be sworn in as an MP, having arrived in Aotearoa as a child asylum seeker with her family from Iran."},{"Party":"National","Name":"Paul Goldsmith","Headshot":"goldsmith.jpg","Description":"National is focused on supporting Epsom and your livelihood, from backing Kiwis who have lost their jobs and are looking to start their own business, to backing existing businesses to take on another employee."},{"Party":"National","Name":"Nicola Grigg","Headshot":"grigg.jpg","Description":"National is focused on supporting Selwyn and your livelihood, from backing Kiwis who have lost their jobs and are looking to start their own business, to backing existing businesses to take on another employee."},{"Party":"Labour","Name":"Shanan Halbert","Headshot":"halbert.jpg","Description":"It’s a privilege everyday to be a strong local voice within Government for the people of Birkenhead, Northcote, Glenfield, Beach Haven, Birkdale and Hillcrest focusing on the issues that matter for our community."},{"Party":"Labour","Name":"Peeni Henare","Headshot":"henare.jpg","Description":"We have come too far not to go further, we have done too much not to do more"},{"Party":"Labour","Name":"Emily Henderson","Headshot":"henderson.jpg","Description":"Whangārei has massive potential. A stunning environment, innovative industries and a well-located port with the easiest access for overseas trading partners."},{"Party":"National","Name":"Harete Hipango","Headshot":"hipango.jpg","Description":"National List MP Harete Hipango has been selected as National’s candidate in Te Tai Hauāuru – the party’s first candidate in a Māori seat since 2002.  "},{"Party":"Labour","Name":"Willie Jackson","Headshot":"jackson.jpg","Description":"If there is one thing that I am most proud of, it is that we never give up on people and everyone deserves another opportunity."},{"Party":"Labour","Name":"Anahila Kanongata'a","Headshot":"kanongata'a.jpg","Description":"I am proud of the work that Labour has done ensuring that struggling New Zealanders are healthy, in secure jobs, and have safe and warm homes. I have been fighting for progressive change since I was elected in 2017, and don't plan on stopping."},{"Party":"National","Name":"Barbara Kuriger","Headshot":"kuriger.jpg","Description":"Now in her third term, Barbara brings experience, enthusiasm, drive and direction to her role as MP for Taranaki-King Country."},{"Party":"Labour","Name":"Ingrid Leary","Headshot":"ingrid.jpg","Description":"Fair and decent living and working conditions for the people of Dunedin South and the Taieri electorate benefits the whole of New Zealand. Continuing with a Labour-led Government is the only way to keep building on the progress already made."},{"Party":"Labour","Name":"Anae Neru Leavasa","Headshot":"leavasa.jpg","Description":"Our children and families are important. I want them to feel safe and have the freedom and opportunity to thrive."},{"Party":"National","Name":"Melissa Lee","Headshot":"lee.jpg","Description":"Born in Korea, and growing up in Malaysia, I moved to New Zealand as a young adult in 1988. My background has ensured me a place as a strong advocate for New Zealand's diverse ethnic communities within the National Caucus. My vision is for a country that is safe, secure, and prosperous."},{"Party":"Labour","Name":"Steph Lewis","Headshot":"lewis.jpg","Description":"I believe in a New Zealand where everyone gets a fair go. To me that means jobs that pay a living wage; a quality education for every child; access to healthcare; and that everyone has a healthy, affordable home."},{"Party":"Labour","Name":"Andrew Little","Headshot":"little.jpg","Description":"Hon Andrew Little is currently the Minister of Defence, Immigration, Public Service and Treaty of Waitangi Negotiations. He is also the Minister Responsible for the GCSB and NZSIS, as well as the Lead Coordinating Minister for the Government's Response to the Royal Commission's Report into the Terrorist Attack on the Christchurch Mosques."},{"Party":"Green","Name":"Jan Logie","Headshot":"logie.jpg","Description":"Jan’s Southland childhood established her deep connection with the beauty of an untouched environment. But it was the impact of the economic reforms of the 1980s that led her toward people-oriented work, giving a voice to those who often go unheard."},{"Party":"Labour","Name":"Anna Lorck","Headshot":"lorck.jpg","Description":"By leading on local issues we can make positive change, empower our local communities and make a real difference for more people living and raising families in Hastings' Tukituki electorate."},{"Party":"Labour","Name":"Marja Lubeck","Headshot":"lubeck.jpg","Description":"It is a privilege to be living and working based in Kaipara ki Mahurangi helping people and organisations achieve success. Let's keep moving!"},{"Party":"National","Name":"Christopher Luxon","Headshot":"luxon.jpg","Description":"Botany is a part of who I am. I lived here growing up, attended local schools, and the hard-working, middle-class values that were instilled in me then are my values today."},{"Party":"Labour","Name":"Jo Luxton","Headshot":"luxton.jpg","Description":"I believe education is the most transformative influence in our lives – it is the one that overcomes every disadvantage with which a child might begin life."},{"Party":"Labour","Name":"Nanaia Mahuta","Headshot":"mahuta.jpg","Description":"As a mother, and a constituent MP with 20 plus years’ experience who has come from ‘flax-root’ politics, Hon Nanaia Mahuta remains connected to the aspirations of people from all walks of life. Those who work hard for a living so that their children can do better, kaumatua, tradespeople, those who aspire to own their home, those who own small businesses and those who lead a range of services and organisations and huge iwi entities."},{"Party":"Labour","Name":"Kieran McAnulty","Headshot":"mcanulty.jpg","Description":"I’ve got really deep roots in this amazing region. My family’s been here for nearly 180 years and that’s why I feel so honoured to be the local MP and to represent in Parliament the wide variety of people who call it home."},{"Party":"National","Name":"Todd McClay","Headshot":"mcclay.jpg","Description":"National is focused on supporting Rotorua and Te Puke and your livelihood, from backing Kiwis who have lost their jobs and are looking to start their own business, to backing existing businesses to take on another employee."},{"Party":"ACT","Name":"James McDowall","Headshot":"mcdowall.jpg","Description":"James has owned a number of small businesses throughout his career, and currently co-owns an immigration law firm. Prior to entering Parliament, he worked for a large NGO in the mental health sector. He has a young, multicultural family and is based in the Waikato. At home, James’ family speak a mix of Cantonese, Mandarin, and English."},{"Party":"ACT","Name":"Nicole McKee","Headshot":"mckee.jpg","Description":"Nicole is a mother of four, has a background in law, and is passionate about firearms reform and freedom of speech. Before entering politics, Nicole ran her own business providing firearms safety training, and is a four-time New Zealand shooting champion."},{"Party":"National","Name":"Ian McKelvie","Headshot":"mckelvie.jpg","Description":"National is focused on supporting Rangitikei and your livelihood, from backing Kiwis who have lost their jobs and are looking to start their own business, to backing existing businesses to take on another employee."},{"Party":"Labour","Name":"Tracey McLellan","Headshot":"mclellan.jpg","Description":"Banks Peninsula is a wonderful slice of New Zealand - the people, the communities and our environment. I’m proud to be our representative in a Labour Government that is focussing on the issues that matter most."},{"Party":"Green","Name":"Ricardo Menéndez March","Headshot":"march.jpg","Description":"Ricardo grew up in Tijuana, Mexico, a place where the politics of hate and division impacted the very land that he lived on."},{"Party":"National","Name":"Mark Mitchell","Headshot":"mitchell.jpg","Description":"National is focused on supporting Whangaparaoa and your livelihood, from backing Kiwis who have lost their jobs and are looking to start their own business, to backing existing businesses to take on another employee"},{"Party":"National","Name":"Joseph Mooney","Headshot":"mooney.jpg","Description":"I am proud to call Southland my home. The electorate of Southland is a regional economic powerhouse in farming, tourism, horticulture, forestry and construction and an increasing presence in information and space technology. I moved here after growing up in Hawke's Bay and my children attended local schools."},{"Party":"National","Name":"Todd Muller","Headshot":"muller.jpg","Description":"National is focused on supporting Bay of Plenty and your livelihood, from backing Kiwis who have lost their jobs and are looking to start their own business, to backing existing businesses to take on another employee."},{"Party":"Labour","Name":"Stuart Nash","Headshot":"nash.jpg","Description":"9 years in Parliament, 6 years as MP for Napier and 3 years a Minister. Proven experience and passion are vital in this environment of uncertainty – and opportunity."},{"Party":"Te Paati Māori","Name":"Debbie Ngarewa-Packer","Headshot":"ngarewa-packer.jpg","Description":"Off the Coast of Te Tai Hauāuru, a descendant of Ngāti Ruanui, Ngāruahine and Ngā Rauru, Debbie Ngarewa-Packer is a current list MP and Co-Leader for Te Pāti Maori. She has been selected to stand again for Te Tai Hauāuru electorate in 2023 and hopes that the mahi she has done over the past three years as the party’s Co-leader and as a list member would’ve given her electorate confidence in her ability to work hard and be a strong advocate for Te Tai Hauāuru."},{"Party":"Labour","Name":"Terisa Ngobi","Headshot":"ngobi.jpg","Description":"I believe in social justice, equality and want to see all New Zealanders living their best lives."},{"Party":"Labour","Name":"Damien O'Connor","Headshot":"oconnor2.jpg","Description":"I'm extremely proud of the ongoing high performance of our primary sector and to be part of a Government that is backing farming for the long-term."},{"Party":"Labour","Name":"Greg O'Connor","Headshot":"oconnor.jpg","Description":"I am proud to have represented Ōhāriu in a Labour-led Government since 2017. As your local voice in Government, I am focused on delivering on our promises for you and your family."},{"Party":"National","Name":"Simon O'Connor","Headshot":"oconnor3.jpg","Description":"National is focused on supporting Tamaki and your livelihood, from backing Kiwis who have lost their jobs and are looking to start their own business, to backing existing businesses to take on another employee."},{"Party":"Labour","Name":"Ibrahim Omer","Headshot":"omer.jpg","Description":"I want everyone who has been in my position to have a better shot at a decent life."},{"Party":"Labour","Name":"Sarah Pallett","Headshot":"pallett.jpg","Description":"A strong voice for the diverse communities of Ilam"},{"Party":"Labour","Name":"David Parker","Headshot":"parker.jpg","Description":"Protecting our environment is hugely important to me. I’ve come to understand that if New Zealand, with all our natural advantages, cannot overcome our environmental challenges, the world won’t."},{"Party":"Labour","Name":"Soraya Peke-Mason","Headshot":"peke-mason.jpg","Description":"Soraya has her roots planted in the Rangitīkei electorate. It has been her home for over two decades after working in Australia during the 1990s where she established businesses in construction, tourism and hospitality."},{"Party":"National","Name":"Chris Penk","Headshot":"penk.jpg","Description":"National is focused on supporting Kaipara Ki Mahurangi and your livelihood, from backing Kiwis who have lost their jobs and are looking to start their own business, to backing existing businesses to take on another employee."},{"Party":"National","Name":"Tama Potaka","Headshot":"potaka.jpg","Description":"Tama Potaka was the chief executive of Ngāi Tai ki Tāmaki. Before starting this role, he worked as a senior advisor to the NZ Super Fund. He spent more than seven years as a general manager at Tainui Group Holdings in Hamilton. He played a pivotal role in many of Tainui’s developments in the city and driving results for Waikato."},{"Party":"Labour","Name":"Willow-Jean Prime","Headshot":"prime.jpg","Description":"Willow-Jean is a māmā and the Minister of Conservation, Minister for Youth, as well as Associate Minister for Arts, Culture and Heritage and Associate Minister of Health. She is married to Dion Prime and they have two daughters, Hihana and Heeni."},{"Party":"National","Name":"Maureen Pugh","Headshot":"pugh.jpg","Description":"Based in Kumara, between Greymouth and Hokitika, Maureen Pugh was National’s candidate for the West Coast – Tasman electorate in the 2014 general election and is now a National List MP.Maureen was first elected to the Westland District Council in 1998, serving two terms before becoming the first woman elected as mayor on the West Coast. She served in that role for 9 years before standing down at the 2013 local body elections."},{"Party":"Labour","Name":"Priyanca Radhakrishnan","Headshot":"radhakrishnan.jpeg","Description":"Priyanca Radhakrishnan is the Minister for the Community and Voluntary Sector, Minister for Disability Issues, Minister for Diversity, Inclusion and Ethnic Communities, as well as Associate Minister for Social Development and Employment and Associate Minister for Workplace Relations and Safety. She is the first person of Indian origin to become a Minister in New Zealand."},{"Party":"National","Name":"Shane Reti","Headshot":"reti.jpg","Description":"E mahi ana ahu mo nga tangata. I work for the people.  People are at the heart of everything I do.  Whether it is fighting for a better Covid response, improving access to medicines and healthcare, securing government’s commitment to the 4-lanes, or standing up for our farmers, businesses and homeowners – I work for you.National is the party that works for the people so that every New Zealander has the opportunity to live the best life possible."},{"Party":"Labour","Name":"Angela Roberts","Headshot":"roberts.jpg","Description":"Angela is a secondary teacher in central Taranaki and past President of the PPTA Te Wehengarua. She grew up in an entrepreneurial household in New Plymouth and studied business at Massey University. After travelling extensively, she came home to work in tourism, local government, and now public education in Taranaki."},{"Party":"Labour","Name":"Grant Robertson","Headshot":"robertson.jpg","Description":"Hon Grant Robertson was born in Palmerston North and lived in Hastings before his family settled in Dunedin. Grant’s belief in social justice and a desire to see every New Zealander able to achieve their potential led him to politics, and he has been the Member of Parliament for Wellington Central since 2008."},{"Party":"Labour","Name":"Dan Rosewarne","Headshot":"rosewarne.jpeg","Description":"Dan enlisted into the NZ Army at the age of 18 and completed an Auto Heavy Engineering apprenticeship. After several years in this role, Dan moved up through the ranks and took on various mentoring, training and logistics management roles."},{"Party":"Labour","Name":"Adrian Rurawhe","Headshot":"rurawhe.jpg","Description":"Adrian Rurawhe is the Speaker of the New Zealand House of Representatives. Through his Iwi and community roles, Adrian has worked successfully to improve the lives of whānau, hapū, Iwi and the community. He is a strong voice in Parliament, and an advocate for the people of Te Tai Hauāuru. He has a particular interest in ensuring that we have empowering policies that help unlock the potential of all whānau."},{"Party":"Labour","Name":"Deborah Russell","Headshot":"russell.jpg","Description":"Deborah Russell lives in the New Lynn electorate with her husband Malcolm Wright. They have three grown up daughters. She was first elected as the MP for New Lynn in the 2017 election."},{"Party":"Green","Name":"Eugenie Sage","Headshot":"sage.jpg","Description":"Eugenie loves Canterbury’s big skies, its braided rivers, and the mountains of Kā Tiritiri o te Moana\/the Southern Alps, which form the spine of Te Wāipounamu\/the South Island. She grew up looking at Rangitoto and spent her first 25 years in Tāmaki Makaurau\/Auckland, where she studied law and history at Auckland University before moving south to study journalism at Canterbury University."},{"Party":"Labour","Name":"Jenny Salesa","Headshot":"salesa.jpg","Description":"Hon Jenny Salesa is MP for the Panmure-Ōtāhuhu electorate, in which she lives with her two daughters, husband and extended family. She is the Assistant Speaker of the New Zealand House of Representatives and Chair of the Parliamentary Foreign Affairs, Defence and Trade Select Committee."},{"Party":"Labour","Name":"Carmel Sepuloni","Headshot":"sepuloni.jpg","Description":"Carmel Sepuloni is a mother, wife, daughter of a migrant, a Government Minister and the Labour MP for Kelston. Born in Waitara, Carmel is of Samoan, Tongan and New Zealand European descent."},{"Party":"ACT","Name":"Toni Severin","Headshot":"severin.jpg","Description":"Toni resides in Christchurch East with her husband. Together they have run their own business which operates in Christchurch and Wellington. Before this, Toni was a Qualified Lab Technician at Christchurch District Health Board for 14-years."},{"Party":"ACT","Name":"David Seymour","Headshot":"seymour.jpg","Description":"David grew up in Whangarei with two younger brothers, where his parents were a pharmacist and a draughtsman. As a teenager, he moved to Auckland for high school before graduating from the University of Auckland in electrical engineering and philosophy."},{"Party":"Green","Name":"James Shaw","Headshot":"shaw.jpg","Description":"James Shaw  firmly believes that New Zealand can be an example to the world in transitioning to a high-value, clean-tech, post-carbon economy that works for everyone. He also believes that, right now, the world needs more such examples to follow and that those that can lead have a duty to do so."},{"Party":"National","Name":"Penny Simmonds","Headshot":"simmonds.jpg","Description":"The Invercargill electorate has been and will always be best placed to understand our needs and the best way to deliver for them. Too many decisions are made in Wellington without understanding the uniqueness of our community."},{"Party":"National","Name":"Scott Simpson","Headshot":"simpson.jpg","Description":"Scott was elected Member of Parliament for Coromandel in November 2011. Prior to entering Parliament , he was CEO of the nationwide children's charity Make-A-Wish New Zealand."},{"Party":"Labour","Name":"Aupito William Sio","Headshot":"sio.jpg","Description":"A member of the Labour Party from 1986, Aupito William Sio has been the elected Member of Parliament (MP) for the Māngere Electorate since 2008."},{"Party":"ACT","Name":"Damien Smith","Headshot":"smith.jpg","Description":"Damien is originally from Northern Ireland and is an ex-banker, Corporate Structured Finance & Family Office Adviser & Independent Company Director. He has a Master in Business Administration (MBA)."},{"Party":"National","Name":"Stuart Smith","Headshot":"smith2.jpg","Description":"Stuart comes from a Canterbury family that were fifth generation sheep & deer farmers. He is married to Julie and father to three adult age children - Hugo, Louis and Fenella."},{"Party":"Labour","Name":"Lemauga Lydia Sosene","Headshot":"lemauga.jpg","Description":"Lemauga Lydia Sosene is a Labour List MP from Favona Māngere Auckland, where she lives with her husband. She is a mother to two sons and has one grandson."},{"Party":"National","Name":"Erica Stanford","Headshot":"stanford.jpg","Description":"I am really proud to have represented the East Coast Bays as your Member of Parliament since 2017. I have worked hard to achieve results on a wide range of projects that are important to our community."},{"Party":"Labour","Name":"Jamie Strange","Headshot":"strange.jpg","Description":"Jamie Strange was elected to Parliament in 2017 on the Labour Party list, and went on to win the Hamilton East electorate in 2020."},{"Party":"Green","Name":"Chlöe Swarbrick","Headshot":"swarbrick.jpg","Description":"Chlöe is your Member of Parliament for Auckland Central. It’s the place she calls home, the community she belongs to and the city – and Hauraki Gulf islands! – she’s proud to represent."},{"Party":"Labour","Name":"Jan Tinetti","Headshot":"tinetti.jpg","Description":"Jan is a list Member of Parliament based in Tauranga. She was born in Hokitika and grew up rurally on the outskirts of Christchurch. Jan attended Villa Maria College before graduating from Christchurch College of Education with a Diploma in Teaching (Primary) and the University of Canterbury with a Bachelor of Education. In 2016 she graduated from the University of Canterbury with a Master’s in Education with First Class Honours."},{"Party":"Labour","Name":"Rino Tirikatene","Headshot":"tirikatene.jpg","Description":"Rino has been the Labour Member of Parliament for Te Tai Tonga since 2011. He proudly represents Māori in the largest electorate in the country."},{"Party":"Green","Name":"Teanau Tuiono","Headshot":"tuiono.jpg","Description":"Teanau has over 20 years experience as an activist, an advocate, and organiser at local, national, and international levels."},{"Party":"Labour","Name":"Phil Twyford","Headshot":"twyford.jpg","Description":"Hon Phil Twyford was born and raised in Auckland. He is the Labour Member of Parliament for Te Atatū, where he lives. Phil’s vision is for New Zealand to deliver hope and opportunity to all people."},{"Party":"National","Name":"Sam Uffindell","Headshot":"uffindell.jpeg","Description":"I’m aspirational for Tauranga and want it to be the best place in New Zealand to live, work and raise a family. I will continue to work incredibly hard as your strong, local voice."},{"Party":"National","Name":"Louise Upston","Headshot":"upston.jpg","Description":"Louise Upston is the Member of Parliament for Taupō, a seat she has held since the General Election of 2008."},{"Party":"Labour","Name":"Tangi Utikere","Headshot":"utikere.jpg","Description":"Tangi is passionate about social justice, equality of opportunity and fairness. With a professional background which combines Local Government and Education, Tangi’s connection to the community is wide and his understanding of the issues that affect the lives and livelihoods of New Zealanders is vast."},{"Party":"National","Name":"Tim van de Molen","Headshot":"van-de-molen.jpg","Description":"Born and bred in the Waikato, Tim van de Molen was elected as the Member of Parliament for Waikato at the 2017 General Election."},{"Party":"ACT","Name":"Brooke van Velden","Headshot":"van-velden.jpg","Description":"Brooke left the private sector to work behind the scenes in Parliament to help pass the End-of-Life Choice Act. She is a highly effective operator who knows how to deliver real positive change in the corridors of power."},{"Party":"Labour","Name":"Ayesha Verrall","Headshot":"verrall.jpg","Description":"Dr Ayesha Verrall is the Minister of Health and Minister of Research, Science and Innovation. She has also previously been the Minister for COVID-19 Response and Minister for Seniors. "},{"Party":"Te Paati Māori","Name":"Rawiri Waititi","Headshot":"waititi.jpg","Description":"Rawiri Waititi is a current Member of the 53 rd Parliament and co-leader of Te Pāti Māori. He is a father of five, iwi leader, Ringatū Minister, creative and kapa haka extraordinaire."},{"Party":"Labour","Name":"Vanushi Walters","Headshot":"walters.jpg","Description":"A Sri Lankan New Zealander, Vanushi’s family moved to New Zealand in 1987. She has a background in law and advocacy and has both national and international experience and has worked in private practice, the public sector and the community sector."},{"Party":"Labour","Name":"Angie Warren-Clark","Headshot":"warren-clark.jpg","Description":"Before becoming an MP, Angie worked to reduce family violence, from volunteer to Domestic Violence Advisor to Womens’ Refuge Manager."},{"Party":"National","Name":"Simon Watts","Headshot":"watts.jpg","Description":"This country needs leadership that enrols all of our energies to tackle the tasks facing us because challenging times demand that we work together in the interests of everyone in this country."},{"Party":"Labour","Name":"Duncan Webb","Headshot":"webb.jpg","Description":"Duncan has served as the MP for Christchurch Central since being elected in 2017. He is currently the Minister of Commerce and Consumer Affairs and Minister for State Owned Enterprises."},{"Party":"Labour","Name":"Helen White","Headshot":"white.jpg","Description":"Helen White is a Barrister, with over 25 years’ experience in employment law and has become a leading voice in advocating for workers’ rights. Over this time she has worked for a variety of unions including EPMU and the Amalgamated Workers Union. Helen believes that employment is a fundamental right, it allows people freedom, choice and to contribute to their community, which is why she fights for equality and fairness in the workplace."},{"Party":"Labour","Name":"Arena Williams","Headshot":"williams.jpg","Description":"Arena Williams (Te Aitanga-a-Māhaki, Ngāi Tahu, Ngāi Tūhoe) is a lawyer and mother of two, she lives in Manurewa with her husband and two young children."},{"Party":"Labour","Name":"Poto Williams","Headshot":"williams2.jpg","Description":"Hon Poto Williams is the Labour Member of Parliament for Christchurch East, where she lives."},{"Party":"National","Name":"Nicola Willis","Headshot":"willis.jpg","Description":"New Zealanders are battling a cost of living crisis and a recession. National will get our country back on track by fixing the economy to reduce the cost of living, restoring law and order, and improving our schools and healthcare."},{"Party":"Labour","Name":"Michael Wood","Headshot":"wood.jpg","Description":"Michael was first elected to Parliament at the 2016 Mt Roskill by-election. In opposition he was Labour’s spokesperson for Transport, Revenue, and Consumer Affairs, and after the election he had roles as Parliamentary Under-Secretary to the Minister for Ethnic Communities and Chair of the Finance & Expenditure Select Committee, before coming into the Chief Labour Whip role in mid-2019."},{"Party":"National","Name":"Michael Woodhouse","Headshot":"woodhouse.jpg","Description":"Michael was first elected to Parliament in 2008 as a National List MP based in Dunedin. During his first term in Parliament, he was a member of the Transport and Industrial select committee, the Health select committee and the Finance and Expenditure select committee. Following the 2011 General Election, Michael was made the Senior Government Whip – a position he held until his appointment as Minister of Immigration, Minister of Veterans’ Affairs and Associate Minister of Transport in January 2013. In May 2014, Michael was also appointed Minister for Land Information."},{"Party":"Labour","Name":"Megan Woods","Headshot":"woods.jpg","Description":"Hon Megan Woods is a Christchurch local, and has been the Member of Parliament for Wigram since 2011. Megan is the Minister of Housing, Minister for Infrastructure, Minister of Energy and Resources, Minister for Building and Construction, as well as the Associate Minister of Finance."}]